Ran Plan for dir: `Basics/multiple_providers` workspace: `default`

<details><summary>Show Output</summary>

```diff

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
+ create

Terraform will perform the following actions:

  # local_file.explicit_file will be created
+ resource "local_file" "explicit_file" {
      + content              = (known after apply)
      + content_base64sha256 = (known after apply)
      + content_base64sha512 = (known after apply)
      + content_md5          = (known after apply)
      + content_sha1         = (known after apply)
      + content_sha256       = (known after apply)
      + content_sha512       = (known after apply)
      + directory_permission = "0777"
      + file_permission      = "0777"
      + filename             = "explicit.txt"
      + id                   = (known after apply)
    }

  # local_file.implicit_file will be created
+ resource "local_file" "implicit_file" {
      + content              = (known after apply)
      + content_base64sha256 = (known after apply)
      + content_base64sha512 = (known after apply)
      + content_md5          = (known after apply)
      + content_sha1         = (known after apply)
      + content_sha256       = (known after apply)
      + content_sha512       = (known after apply)
      + directory_permission = "0777"
      + file_permission      = "0777"
      + filename             = "implicit.txt"
      + id                   = (known after apply)
    }

  # random_integer.file1 will be created
+ resource "random_integer" "file1" {
      + id     = (known after apply)
      + max    = 200
      + min    = 50
      + result = (known after apply)
    }

  # random_string.file2 will be created
+ resource "random_string" "file2" {
      + id          = (known after apply)
      + length      = 10
      + lower       = true
      + min_lower   = 0
      + min_numeric = 0
      + min_special = 0
      + min_upper   = 0
      + number      = true
      + numeric     = true
      + result      = (known after apply)
      + special     = true
      + upper       = true
    }

Plan: 4 to add, 0 to change, 0 to destroy.

```

* :arrow_forward: To **apply** this plan, comment:
    * `atlantis apply -d Basics/multiple_providers`
* :put_litter_in_its_place: To **delete** this plan click [here](http://390dbc82e4db:4141/lock?id=yashwanthm998%252Fterraform-gcp%252FBasics%252Fmultiple_providers%252Fdefault)
* :repeat: To **plan** this project again, comment:
    * `atlantis plan -d Basics/multiple_providers`
</details>
Plan: 4 to add, 0 to change, 0 to destroy.

---
* :fast_forward: To **apply** all unapplied plans from this pull request, comment:
    * `atlantis apply`
* :put_litter_in_its_place: To delete all plans and locks for the PR, comment:
    * `atlantis unlock`
